balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ256GP610.PIC
        <edc:SFRDef edc:access="--rrrrrrccc-cccc" edc:cname="C1INTF" edc:desc="" edc:impl="0x3fef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1INTF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TBIF" edc:desc="" edc:mask="0x1" edc:name="TBIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RBIF" edc:desc="" edc:mask="0x1" edc:name="RBIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RBOVIF" edc:desc="" edc:mask="0x1" edc:name="RBOVIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOIF" edc:desc="" edc:mask="0x1" edc:name="FIFOIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ERRIF" edc:desc="" edc:mask="0x1" edc:name="ERRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IVRIF" edc:desc="" edc:mask="0x1" edc:name="IVRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXWAR" edc:desc="" edc:mask="0x1" edc:name="RXWAR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWAR" edc:desc="" edc:mask="0x1" edc:name="TXWAR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="C1INTE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1INTE" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TBIE" edc:desc="" edc:mask="0x1" edc:name="TBIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RBIE" edc:desc="" edc:mask="0x1" edc:name="RBIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RBOVIE" edc:desc="" edc:mask="0x1" edc:name="RBOVIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOIE" edc:desc="" edc:mask="0x1" edc:name="FIFOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ERRIE" edc:desc="" edc:mask="0x1" edc:name="ERRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIE" edc:desc="" edc:mask="0x1" edc:name="WAKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IVRIE" edc:desc="" edc:mask="0x1" edc:name="IVRIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1EC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1EC" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RERRCNT" edc:desc="" edc:mask="0xff" edc:name="RERRCNT" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TERRCNT" edc:desc="" edc:mask="0xff" edc:name="TERRCNT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RERRCNT0" edc:desc="" edc:mask="0x1" edc:name="RERRCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT1" edc:desc="" edc:mask="0x1" edc:name="RERRCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT2" edc:desc="" edc:mask="0x1" edc:name="RERRCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT3" edc:desc="" edc:mask="0x1" edc:name="RERRCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT4" edc:desc="" edc:mask="0x1" edc:name="RERRCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT5" edc:desc="" edc:mask="0x1" edc:name="RERRCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT6" edc:desc="" edc:mask="0x1" edc:name="RERRCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RERRCNT7" edc:desc="" edc:mask="0x1" edc:name="RERRCNT7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT0" edc:desc="" edc:mask="0x1" edc:name="TERRCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT1" edc:desc="" edc:mask="0x1" edc:name="TERRCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT2" edc:desc="" edc:mask="0x1" edc:name="TERRCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT3" edc:desc="" edc:mask="0x1" edc:name="TERRCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT4" edc:desc="" edc:mask="0x1" edc:name="TERRCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT5" edc:desc="" edc:mask="0x1" edc:name="TERRCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT6" edc:desc="" edc:mask="0x1" edc:name="TERRCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TERRCNT7" edc:desc="" edc:mask="0x1" edc:name="TERRCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
